/* If a X500 name has a description and a common name we display CommonName (Description) using this format string */
"%@ (%@)" = "%1$@ (%2$@)";

/* Format string used to build a list of values, first argument is list second argument is to be appended element */
"%@, %@" = "%1$@, %2$@";

/* Format string for encoded field data (e.g. Sequence; 128 bytes; data = 00 00 ...) */
"%@; %d %@; data = %@" = "%1$@; %2$d %3$@; дані = %4$@";

/* format string to turn version number into a string */
"%d" = "%d";

/* Value of a field if its length is 0 */
"<NULL>" = "<NULL>";

/* CRL Distribution Points extension supported reason name */
"AA Compromise" = "Згода AA";

/* Label of field in authority info access extension */
"Access Location" = "Розташування доступу";

/* Label of field in authority info access extension */
"Access Method" = "Метод доступу";

/* CRL Distribution Points extension supported reason name */
"Affiliation Changed" = "Відношення змінено";

/* Label of the algorithm subfield of an AlgorithmIdentifer */
"Algorithm" = "Алгоритм";

/* Label of field in Authority Key Identifier extension */
"Authority Certificate Serial Number" = "Серійний номер сертифіката центра";

/* Authority info access extension label */
"Authority Information Access" = "Доступ до відомостей центра";

/* Authority Key Identifier extension label */
"Authority Key Identifier" = "Ідентифікатор ключа повноважень";

/* Label used for Basic Constraints when value is invalid */
"Basic Constraints" = "Чільні обмеження";

/* First argument to SEC_BLOB_KEY format string for a bit string */
"Bit string" = "Рядок бітів";

/* No comment provided by engineer. */
"bits" = "біти";

/* First argument to SEC_BLOB_KEY format string for a Byte string */
"Byte string" = "Рядок байтів";

/* Third argument to SEC_BLOB_KEY format string for a byte string */
"bytes" = "байти";

/* CRL Distribution Points extension supported reason name */
"CA Compromise" = "ЦС скомпроментовано";

/* X.509 key usage bitfield name */
"Cert Sign" = "Знак сертифіката";

/* Label for boolean is_ca property of a basic constraints extension */
"Certificate Authority" = "Центр сертифікації";

/* CRL Distribution Points extension supported reason name */
"Certificate Hold" = "Фіксація сертифіката";

/* Certificate Policies extension label */
"Certificate Policies" = "Політики сертифікатів";

/* No comment provided by engineer. */
"Certificate Type" = "Тип сертифіката";

/* CRL Distribution Points extension supported reason name */
"Cessation Of Operation" = "Зупинення дії";

/* Label of field in Certificate Policies extension */
"CPS URI" = "CPS URI";

/* Label of field in extension that indicates whether this extension is critical */
"Critical" = "Обов’язково";

/* CRL Distribution Points extension label */
"CRL Distribution Points" = "Точки розподілу СВС";

/* Label for CRL issuer field of CRL Distribution Points extension */
"CRL Issuer" = "Видавець СВС";

/* X.509 key usage bitfield name */
"CRL Sign" = "Знак СВС";

/* Label for raw data of extension (used for unknown extensions) */
"Data" = "Дані";

/* X.509 key usage bitfield name */
"Data Encipherment" = "Криптографічний захист даних";

/* X.509 key usage bitfield name */
"Decipher Only" = "Тільки розшифрування";

/* X.509 key usage bitfield name */
"Digital Signature" = "Цифровий підпис";

/* label for general name field value */
"Directory Name" = "Назва каталогу";

/* label for general name field value */
"DNS Name" = "DNS-ім’я";

/* label for general name field value */
"EDI Party Name" = "Ім’я сторони EDI";

/* label for general name field value */
"Email Address" = "Адреса електронної пошти";

/* X.509 key usage bitfield name */
"Encipher Only" = "Тільки шифрування";

/* No comment provided by engineer. */
"Expired" = "Прострочений";

/* Label of expiration date value when certificate is temporally valid */
"Expires" = "Спливає";

/* Label of field in Certificate Policies extension */
"Explicit Text" = "Відвертий текст";

/* Extended key usage extension label */
"Extended Key Usage" = "Використання розширеного ключа";

/* Label used for General Name entry when value is invalid */
"General Name" = "Загальне ім’я";

/* Label used for General Names when value is invalid */
"General Names" = "Загальні імена";

/* No comment provided by engineer. */
"Hostname mismatch." = "Незбіг імен хостів.";

/* Label of field in policy constraints extension */
"Inhibit Policy Mapping" = "Заборонити перетворення політик";

/* Label of a value is printed into this string if the data is not valid */
"Invalid %@" = "Недійсний %@";

/* No comment provided by engineer. */
"Invalid certificate chain linkage." = "Неправильний зв’язок ланцюга сертифікатів.";

/* label for general name field value */
"IP Address" = "IP-адреса";

/* No comment provided by engineer. */
"Issued By" = "Видано";

/* No comment provided by engineer. */
"Issuer Name" = "Ім’я видавця";

/* No comment provided by engineer. */
"Issuer Summary" = "Резюме видавця";

/* No comment provided by engineer. */
"Issuer Unique ID" = "Унікальний ідентифікатор видавця";

/* X.509 key usage bitfield name */
"Key Agreement" = "Узгодження ключів";

/* CRL Distribution Points extension supported reason name */
"Key Compromise" = "Розкриття ключа";

/* X.509 key usage bitfield name */
"Key Encipherment" = "Шифрування ключа";

/* Label of field in Subject or Authority Key Identifier extension */
"Key Identifier" = "Ідентифікатор ключа";

/* Subsection label in CRL Distribution Points extension. */
"Name Relative To CRL Issuer" = "Ім’я зв’язане з видавцем СВС";

/* Value for a boolean property when it's value is false (example critical: no) */
"No" = "Ні";

/* X.509 key usage bitfield name */
"Non-Repudiation" = "Невідмовність";

/* field value of parameters field when no parameters are present */
"none" = "немає";

/* format string for undisplayed field data with a given DER tag and length */
"not displayed (tag = %@; length %d)" = "не відображено (тег = %1$@; довжина %2$d)";

/* label indicating the date after which something is no longer valid */
"Not Valid After" = "Недійсний після";

/* label indicating the soonest date at which something is valid */
"Not Valid Before" = "Недійсний до";

/* Label of field in Certificate Policies extension */
"Notice Numbers" = "Номери сповіщень";

/* Netscape certificate type usage value */
"Object Signing" = "Підписання об’єкта";

/* Netscape certificate type usage value */
"Object Signing CA" = "ЦС підписання об’єкта";

/* value of an oid field if it's length is more than what we allow for oids */
"Oid too long" = "ІО задовгий";

/* No comment provided by engineer. */
"One or more certificates have expired or are not valid yet." = "Один або більше сертифікатів стали недійсними або ще недійсні.";

/* No comment provided by engineer. */
"One or more unsupported critical extensions found." = "Знайдено одне або більше непідтримуваних критичних розширень.";

/* Label of field in Certificate Policies extension */
"Organization" = "Організація";

/* Label used for Other Name RDN when value is invalid */
"Other Name" = "Інша назва";

/* Label of the parameters subfield of an AlgorithmIdentifer */
"Parameters" = "Параметри";

/* Label for path length constraint property of a basic constraints extension */
"Path Length Constraint" = "Обмеження довжини шляху";

/* Policy constraints extension label */
"Policy Constraints" = "Обмеження політики";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Identifier #%d" = "Ідентифікатор політики #%d";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Qualifier #%d" = "Кваліфікатор політики #%d";

/* No comment provided by engineer. */
"Policy requirements not met." = "Невідповідність вимогам політики.";

/* Label for an invlaid private key se perion value */
"Private Key Usage Period" = "Термін використання особистого ключа";

/* CRL Distribution Points extension supported reason name */
"Privilege Withdrawn" = "Право вилучено";

/* No comment provided by engineer. */
"Public Key Algorithm" = "Алгоритм відкритого ключа";

/* No comment provided by engineer. */
"Public Key Data" = "Дані відкритого ключа";

/* Label of field in extended key usage extension */
"Purpose" = "Призначення";

/* Label of field in Certificate Policies extension */
"Qualifier" = "Кваліфікатор";

/* Label of a RDN */
"RDN" = "RDN";

/* CRL Distribution Points extension supported reasons bitfield label */
"Reasons" = "Причини";

/* label for general name field value */
"Registered ID" = "Зареєстрований ідентифікатор";

/* Label of field in policy constraints extension */
"Require Explicit Policy" = "Запит на відкриту політику";

/* Netscape certificate type usage value */
"Reserved" = "Зарезервований";

/* No comment provided by engineer. */
"Root certificate is not trusted." = "Ненадійний кореневий сертифікат";

/* Netscape certificate type usage value */
"S/MIME" = "S/MIME";

/* Netscape certificate type usage value */
"S/MIME CA" = "ЦС S/MIME";

/* First argument to SEC_BLOB_KEY format string for a Sequence */
"Sequence" = "Послідовність";

/* No comment provided by engineer. */
"Serial Number" = "Серійний номер";

/* First argument to SEC_BLOB_KEY format string for a Set */
"Set" = "Набір";

/* No comment provided by engineer. */
"Signature" = "Підпис";

/* No comment provided by engineer. */
"Signature Algorithm" = "Алгоритм підпису";

/* Netscape certificate type usage value */
"SSL CA" = "ЦС SSL";

/* Netscape certificate type usage value */
"SSL client" = "Клієнт SSL";

/* Netscape certificate type usage value */
"SSL server" = "Сервер SSL";

/* Subject Key Identifier extension label */
"Subject Key Identifier" = "Ідентифікатор ключа теми";

/* No comment provided by engineer. */
"Subject Name" = "Назва теми";

/* No comment provided by engineer. */
"Subject Unique ID" = "Унікальний ідентифікатор теми";

/* CRL Distribution Points extension supported reason name */
"Superseded" = "Замінений";

/* No comment provided by engineer. */
"This certificate has an issuer that has expired" = "Видавець цього сертифіката вже недійсний";

/* No comment provided by engineer. */
"This certificate has an issuer that is not yet valid" = "Видавець цього сертифіката ще недійсний";

/* No comment provided by engineer. */
"This certificate has expired" = "Термін дії цього сертифіката закінчився";

/* No comment provided by engineer. */
"This certificate is not yet valid" = "Цей сертифікат ще недійсний";

/* The certificate is temporally valid */
"This certificate is valid" = "Дійсний сертифікат";

/* Label of a value is printed into this string if the data can not been parsed according to it's type */
"Unparsed %@" = "Аналіз %@ не виконано";

/* CRL Distribution Points extension supported reason name */
"Unused" = "Не використовується";

/* label for general name field value */
"URI" = "URI";

/* Label for KeyUsage bitfield values */
"Usage" = "Використання";

/* No comment provided by engineer. */
"Valid from" = "Дійсно з";

/* No comment provided by engineer. */
"Version" = "Версія";

/* label for general name field value */
"X.400 Address" = "Адреса X.400";

/* Label of a X.501 Name */
"X.501 Name" = "Ім’я X.501";

/* No comment provided by engineer. */
"X.509 version %d %scertificate" = "Версія X.509 %1$d %2$sсертифікат";

/* Value for a boolean property when it's value is true (example critical: yes) */
"Yes" = "Так";

